In [2]:
# Data Visualizations
# 1) Software/tech jobs split up by state (identify lowest steps)
# 2) Software/tech jobs split up by city in the midwestern states 
# 3) Number of software/tech students per Midwestern university

In [3]:
# Data Source(s):
# US Bureau of Labor Statistics (May 2019)
# National Center for Education Statistics (NCES) (2018-2019)

In [4]:
import os.path
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

In [5]:
data = "/Users/skasralikar/Desktop/github/rmds/datasets"
state = pd.read_csv(os.path.join(data,'job_state.csv'), sep =',')
city = pd.read_csv(os.path.join(data, 'job_city.csv'), sep =',')
majors = pd.read_csv(os.path.join(data, 'CS_majors.csv'), sep = ',')
statecode = pd.read_csv(os.path.join(data, 'state_code.csv'),sep = ',')

In [11]:
state.isnull().any()
city.isnull().any()

area_title    False
City          False
State         False
State          True
occ_title     False
tot_emp       False
dtype: bool

In [12]:
majors.isnull().any()

UnitID                                                              False
Institution Name                                                    False
FIPS state code (HD2018)                                            False
Grand total (EF2018CP  14.0000-Engineering  Undergraduate total)     True
Unnamed: 4                                                           True
dtype: bool

In [26]:
tech = "Computer and Information Systems Managers|Computer and Mathematical Occupations|Computer Occupations, All Other"

In [34]:
statetech = state[state['occ_title'].str.contains(tech)]
statetech.drop(['occ_title'], axis = 1)
statetech

           area_title tot_emp
10            Alabama   3,650
61            Alabama  44,070
72            Alabama   2,240
732            Alaska     500
780            Alaska   5,050
...               ...     ...
35679     Puerto Rico  12,110
35690     Puerto Rico     880
36204  Virgin Islands      50
36226  Virgin Islands     370
36230  Virgin Islands      60

[162 rows x 2 columns]